Refactor streaming engine
